# Data Input nd Output

In [1]:
import numpy as np
import pandas as pd

# Importing Data Set
CSV File

In [2]:
df = pd.read_csv('Markssheet.csv')

In [3]:
df

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

In [4]:
df.to_csv('example',index=True)

In [5]:
df

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

# Data Selection

In [6]:
data =pd.read_csv('Markssheet.csv')

In [7]:
data

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

In [8]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
data.columns

Index(['Names', 'Id', 'Marks', 'Percentage'], dtype='object')

In [10]:
data['Names']

0     Suji
1    Vijay
2    Subbu
3     Abhi
4    Dhanu
Name: Names, dtype: object

In [11]:
data[['Id','Percentage']]

    Id  Percentage
0  556          68
1  555          69
2  553          65
3  560          70
4  570          80

In [12]:
data.iloc[ : ,1]

0    556
1    555
2    553
3    560
4    570
Name: Id, dtype: int64

In [13]:
data.iloc[0:2,0:2]

   Names   Id
0   Suji  556
1  Vijay  555

In [14]:
data.loc[0]

Names         Suji
Id             556
Marks          200
Percentage      68
Name: 0, dtype: object

In [15]:
data.loc[0:3,'Names':'Marks']

   Names   Id  Marks
0   Suji  556    200
1  Vijay  555    320
2  Subbu  553    280
3   Abhi  560    400

In [16]:
data.iloc[ : ,[0,1,2]]

   Names   Id  Marks
0   Suji  556    200
1  Vijay  555    320
2  Subbu  553    280
3   Abhi  560    400
4  Dhanu  570    500

# Selecting Rows

In [17]:
df

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

In [18]:
data.loc[2]

Names         Subbu
Id              553
Marks           280
Percentage       65
Name: 2, dtype: object

In [19]:
data.iloc[0:5 , ]

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

In [20]:
data.iloc[1:3,0:2]

   Names   Id
1  Vijay  555
2  Subbu  553

In [21]:
data.loc[3]

Names         Abhi
Id             560
Marks          400
Percentage      70
Name: 3, dtype: object

In [23]:
data.loc[[0,1,4]]

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
4  Dhanu  570    500          80

In [38]:
data.loc[[0,1],['Marks','Percentage']]

   Marks  Percentage
0    200          68
1    320          69

# data.loc

In [39]:
data

   Names   Id  Marks  Percentage
0   Suji  556    200          68
1  Vijay  555    320          69
2  Subbu  553    280          65
3   Abhi  560    400          70
4  Dhanu  570    500          80

In [24]:
data.index = ['R1','R2','R3','R4','R5']

In [25]:
data

    Names   Id  Marks  Percentage
R1   Suji  556    200          68
R2  Vijay  555    320          69
R3  Subbu  553    280          65
R4   Abhi  560    400          70
R5  Dhanu  570    500          80

In [26]:
data.columns = ['C1','C2','C3','C4']

In [27]:
data

       C1   C2   C3  C4
R1   Suji  556  200  68
R2  Vijay  555  320  69
R3  Subbu  553  280  65
R4   Abhi  560  400  70
R5  Dhanu  570  500  80

In [28]:
data

       C1   C2   C3  C4
R1   Suji  556  200  68
R2  Vijay  555  320  69
R3  Subbu  553  280  65
R4   Abhi  560  400  70
R5  Dhanu  570  500  80

In [29]:
data.columns = ['Nmaes','Id','Marks','Percentage']

In [30]:
data

    Nmaes   Id  Marks  Percentage
R1   Suji  556    200          68
R2  Vijay  555    320          69
R3  Subbu  553    280          65
R4   Abhi  560    400          70
R5  Dhanu  570    500          80

In [31]:
data.loc['R1']

Nmaes         Suji
Id             556
Marks          200
Percentage      68
Name: R1, dtype: object

In [32]:
data.iloc[3]

Nmaes         Abhi
Id             560
Marks          400
Percentage      70
Name: R4, dtype: object

In [33]:
data.loc['R2':'R5']

    Nmaes   Id  Marks  Percentage
R2  Vijay  555    320          69
R3  Subbu  553    280          65
R4   Abhi  560    400          70
R5  Dhanu  570    500          80

In [34]:
data.iloc[0:3]

    Nmaes   Id  Marks  Percentage
R1   Suji  556    200          68
R2  Vijay  555    320          69
R3  Subbu  553    280          65

In [35]:
data.loc['R1': ]

    Nmaes   Id  Marks  Percentage
R1   Suji  556    200          68
R2  Vijay  555    320          69
R3  Subbu  553    280          65
R4   Abhi  560    400          70
R5  Dhanu  570    500          80

In [36]:
data.loc['R1': , : 'Marks']

    Nmaes   Id  Marks
R1   Suji  556    200
R2  Vijay  555    320
R3  Subbu  553    280
R4   Abhi  560    400
R5  Dhanu  570    500

In [37]:
data.iloc[1:4,1:4]

     Id  Marks  Percentage
R2  555    320          69
R3  553    280          65
R4  560    400          70

In [38]:
data.loc[['R1','R2'],['Marks','Percentage']]

    Marks  Percentage
R1    200          68
R2    320          69